{
  "posts": [
    {
      "slug": "writing-technical-content-when-debugging",
      "title": "Writing Technical Content When You're Too Tired to Be Funny",
      "description": "It's hour 6 of debugging. The bug is fixed. This is not the time to write something entertaining—but it is the perfect time to write something useful. Here's the two-pass approach to technical blogging.",
      "category": "Writing",
      "tags": ["writing", "blogging", "process", "debugging", "humor", "craft"],
      "date": "2026-06-22",
      "featured": true,
      "image": "/img/posts/writing-technical-content-when-debugging.svg",
      "linkedInHook": "It's 11:47 PM. The bug is fixed. I have 43 browser tabs open and my coffee went cold two hours ago.\n\nThis is not the time to write something entertaining.\n\nBut it IS the perfect time to write something useful.\n\nMost of my 'entertaining' technical posts started as exhausted notes at unreasonable hours. The wit wasn't there originally. The analogies came later.\n\nCapture the details while they're fresh. Add the humor when you can actually be funny.\n\nThe entertaining version is always a second pass."
    },
    {
      "slug": "schema-aware-ef-core-migrations",
      "title": "Schema-Aware EF Core Migrations: One Migration Set, Multiple Environments",
      "description": "EF Core migrations don't natively support runtime schema selection. Here's how to intercept migration operations and inject the correct schema for local, dev, staging, and production.",
      "category": "Computers",
      "tags": ["ef-core", "dotnet", "sql-server", "migrations", "multi-tenant", "patterns"],
      "date": "2026-06-16",
      "featured": true,
      "image": "/img/posts/schema-aware-ef-core-migrations.svg",
      "linkedInHook": "\"Which environment did that migration just run against?\"\n\nI stared at Slack with that sinking feeling. EF Core migrations don't support runtime schema selection—the schema is baked in when you generate the migration.\n\nSo I built a custom SQL generator that intercepts operations mid-flight and injects the correct schema.\n\nNow: same migrations, different schemas. [local], [dev], [stg], [dbo]. No more \"wait, which one did I just hit?\" moments.\n\nPart 3 of the Enterprise Database Patterns series."
    },
    {
      "slug": "encrypted-configuration-pattern",
      "title": "Database-Backed Encrypted Configuration: Stop Committing Secrets",
      "description": "I once committed an API key to a public repo at 3 AM. That incident taught me secrets in source control are a when problem, not an if problem. Here's the pattern that makes the mistake impossible.",
      "category": "Computers",
      "tags": ["security", "encryption", "dotnet", "configuration", "aes-gcm", "patterns"],
      "date": "2026-06-10",
      "featured": true,
      "image": "/img/posts/encrypted-configuration-pattern.svg",
      "linkedInHook": "I once committed an API key to a public GitHub repo. It was 3 AM. The deploy was \"almost done.\"\n\nThree hours later, my inbox was full of AWS alerts.\n\nThat incident taught me: secrets in source control are a WHEN problem, not an IF problem.\n\nSo I built database-backed configuration with AES-256-GCM encryption. The key file is gitignored. Secrets are encrypted at rest. Your code uses IConfiguration normally—it just works.\n\nPart 2 of the Enterprise Database Patterns series."
    },
    {
      "slug": "modern-database-testing-with-xunit-fixtures",
      "title": "Modern Database Testing: Why InMemory Databases Lie To You",
      "description": "My test passed locally and caught fire in staging. That's when I learned UseInMemoryDatabase() is like a friend who tells you that outfit looks great when it definitely does not.",
      "category": "Computers",
      "tags": ["testing", "xunit", "ef-core", "sql-server", "respawn", "integration-testing"],
      "date": "2026-06-04",
      "featured": true,
      "image": "/img/posts/modern-database-testing-with-xunit-fixtures.svg",
      "linkedInHook": "The test passed. Ship it, right?\n\nThen I deployed to staging and watched everything catch fire. The LINQ query that worked against UseInMemoryDatabase() generated SQL that SQL Server refused to execute.\n\nInMemory databases lie to you. They're fast and convenient, like a friend who tells you that outfit looks great when it definitely does not.\n\nThe fix: real SQL Server + Respawn. ~20ms resets instead of ~1000ms. When tests pass now, I actually believe them.\n\nPart 1 of the Enterprise Database Patterns series."
    },
    {
      "slug": "cicd-version-verification",
      "title": "CI/CD Version Verification: Trust But Verify Your Deployments",
      "description": "MSDeploy can return success even when your app fails to start. Here's how to add version endpoints and automated verification to catch those ghost deployments before your users do.",
      "category": "Computers",
      "tags": ["cicd", "github-actions", "devops", "deployment", "monitoring", "dotnet"],
      "date": "2026-05-29",
      "featured": true,
      "image": "/img/posts/cicd-version-verification.svg",
      "linkedInHook": "Your deploy succeeded. But did it *actually* work?\n\nMSDeploy syncs files successfully, but that doesn't mean your app is healthy. Config might be wrong. Database might not connect. App might crash on startup.\n\nThe fix: version endpoints that return what's actually running, and a verify job that compares it to what you just deployed.\n\nBonus: include uptime in the response. If it shows 0:00:05 when you expected hours, something restarted unexpectedly.\n\nVersion endpoints are cheap insurance. A few minutes of setup saves hours of 'why isn't my code deployed?' debugging."
    },
    {
      "slug": "maui-blazor-pending-count-debugging-marathon",
      "title": "The Pending Count That Wouldn't Stay: A MAUI Blazor Debugging Marathon",
      "description": "What started as 'the pending count resets to zero' turned into a 7+ hour journey through Blazor component lifecycle, INotifyPropertyChanged, MAUI deployment quirks, MinVer versioning, and multi-environment debugging.",
      "category": "Computers",
      "tags": ["maui", "blazor", "debugging", "state-management", "inotifypropertychanged", "mobile"],
      "date": "2026-05-24",
      "featured": true,
      "image": "/img/posts/maui-blazor-pending-count-debugging-marathon.svg",
      "linkedInHook": "Navigate away and back. The pending count is 0.\n\nThe data was still there. The count just wasn't updating.\n\n7+ hours later, I found the root cause: two services were both calling SetPendingCount() with their own count. LoggingService set it to 3, then SyncService immediately overwrote it with 0.\n\nThe fix: separate counts per service, INotifyPropertyChanged for granular updates, and Blazor components that subscribe to changes.\n\nPlus 4 bonus rabbit holes: ObjectDisposedException, Debug APKs that won't start, MinVer returning 0.0.0, and syncing to the wrong server.\n\nSometimes a 'quick test' is anything but."
    },
    {
      "slug": "breaking-circular-dependencies-with-solid-principles",
      "title": "Breaking Circular Dependencies with SOLID Principles",
      "description": "When two services need each other, it's tempting to reach for IServiceProvider and lazy loading. But that quick fix hides architectural wounds. Here's how extracting shared concerns breaks the cycle properly.",
      "category": "Computers",
      "tags": ["solid", "architecture", "dependency-injection", "refactoring", "dotnet", "patterns"],
      "date": "2026-05-19",
      "featured": true,
      "image": "/img/posts/breaking-circular-dependencies-with-solid-principles.svg",
      "linkedInHook": "The build failed. Circular dependency detected.\n\nTwo services needed each other. SyncService logs operations. LoggingService syncs logs. Classic tangle.\n\nThe quick fix: IServiceProvider + lazy loading. It compiles. It runs.\n\nThe problem: hidden dependencies, testing nightmares, and the architectural wound stays open.\n\nThe real fix: extract the shared concern. Create ISyncStatusService to own the state both services need. Now they depend on the abstraction, not each other.\n\n30 minutes longer. Pays dividends forever."
    },
    {
      "slug": "automatic-semantic-versioning-with-minver",
      "title": "Automatic Semantic Versioning with MinVer: Never Manually Bump Again",
      "description": "Version numbers in three .csproj files, remembering to create git tags, hoping you didn't fat-finger 0.9.1 as 0.91. MinVer eliminates all of it by deriving versions from git tags automatically.",
      "category": "Computers",
      "tags": ["versioning", "semver", "minver", "cicd", "dotnet", "github-actions", "devops"],
      "date": "2026-05-14",
      "featured": true,
      "image": "/img/posts/automatic-semantic-versioning-with-minver.svg",
      "linkedInHook": "I used to dread version bumps. Update three .csproj files, create a git tag, hope I didn't fat-finger 0.9.1 as 0.91.\n\nThen I discovered MinVer. Now I never manually set a version number.\n\nThe version IS the git tag. MinVer reads your git history and calculates the version at build time. Developers commit code. Release pipelines create tags. The cycle continues automatically.\n\nOne Directory.Build.props file. Zero manual edits. Zero version mismatches."
    },
    {
      "slug": "tracer-bullet-development-prove-your-pipeline",
      "title": "Tracer Bullet Development: How Error Logging Proved My Entire Sync Architecture",
      "description": "Before building months of features, I built one thing: error logging. It proved the entire Mobile → API → Database → Web Admin pipeline worked—and found four bugs that would have been painful later.",
      "category": "Computers",
      "tags": ["architecture", "tracer-bullet", "integration", "mobile", "pragmatic-programmer", "patterns"],
      "date": "2026-05-09",
      "featured": true,
      "image": "/img/posts/tracer-bullet-development-prove-your-pipeline.svg",
      "linkedInHook": "How do you know your architecture works before building months of features?\n\nBuild a tracer bullet. One thin, end-to-end implementation that proves the whole pipeline.\n\nI chose error logging. Simple data, no business rules, but it touches every layer: Mobile → API → Database → Web Admin.\n\nIn one day, I validated 11 integration points. And found 4 bugs that would have been painful to debug in complex features.\n\nNow every new feature is 'just another endpoint' instead of 'I hope this fits together.'"
    },
    {
      "slug": "testing-non-virtual-members-without-moq",
      "title": "Testing Non-Virtual Members: When Moq Can't Help and SOLID Saves the Day",
      "description": "Moq throws NotSupportedException on NavigationManager.Uri because it's not virtual. Here's why that connects to SOLID principles, and two patterns to test it anyway.",
      "category": "Computers",
      "tags": ["testing", "moq", "solid", "dotnet", "unit-testing", "patterns"],
      "date": "2026-05-04",
      "featured": true,
      "image": "/img/posts/testing-non-virtual-members-without-moq.svg",
      "linkedInHook": "Moq threw NotSupportedException: 'Non-overridable members may not be used in setup expressions.'\n\nNavigationManager.Uri isn't virtual. Microsoft chose safety over testability—you can't bypass their initialization logic.\n\nThis is SOLID in action. LSP says subclasses should be substitutable. Microsoft said 'we don't trust your substitution here.'\n\nTwo workarounds: inherit and override protected methods, or wrap it in your own interface. Both work. Choose based on what you're testing."
    },
    {
      "slug": "maui-blazor-navigationmanager-not-initialized",
      "title": "NavigationManager 'Not Initialized' - The MAUI Blazor Hybrid Gotcha",
      "description": "Your error boundary works in Blazor WASM but crashes in MAUI Hybrid with 'WebViewNavigationManager has not been initialized.' Here's why and how to fix it.",
      "category": "Computers",
      "tags": ["maui", "blazor", "hybrid", "navigationmanager", "error-handling", "mobile"],
      "date": "2026-04-29",
      "featured": true,
      "image": "/img/posts/maui-blazor-navigationmanager-not-initialized.svg",
      "linkedInHook": "Built an error boundary that worked perfectly in Blazor WASM. Deployed to MAUI Hybrid on Android. Immediate crash:\n\n'WebViewNavigationManager has not been initialized.'\n\nThe issue: in MAUI, NavigationManager wraps a native WebView. During early error handling, the WebView isn't ready yet. Accessing .Uri throws.\n\nThe fix is embarrassingly simple: wrap it in try-catch. Defensive programming wins again."
    },
    {
      "slug": "error-boundaries-that-dont-trap-users",
      "title": "Error Boundaries That Don't Trap Users: A UX Lesson in Blazor",
      "description": "Your Blazor ErrorBoundary catches the error but blocks the user's escape route. They can't navigate away. Here's how to make error boundaries recover on navigation.",
      "category": "Computers",
      "tags": ["blazor", "ux", "error-handling", "errorboundary", "user-experience"],
      "date": "2026-04-24",
      "featured": true,
      "image": "/img/posts/error-boundaries-that-dont-trap-users.svg",
      "linkedInHook": "Added an ErrorBoundary to my Blazor app. Caught errors, showed a nice message. Great!\n\nThen a user hit an error and tried to navigate away. Nothing happened. They were trapped.\n\nThe error boundary was a cage, not a safety net.\n\nThe fix: subscribe to NavigationManager.LocationChanged and call Recover() when the user navigates. Now errors don't break navigation.\n\nRule: errors should never block the user's escape route."
    },
    {
      "slug": "crockford-base32-phone-friendly-reference-ids",
      "title": "Phone-Friendly Reference IDs: Why Crockford Base32 is Perfect for Support",
      "description": "GUIDs over the phone are a nightmare. 'Is that zero or the letter O?' Douglas Crockford's Base32 encoding removes ambiguous characters entirely.",
      "category": "Computers",
      "tags": ["ux", "encoding", "base32", "support", "human-factors"],
      "date": "2026-04-19",
      "featured": true,
      "image": "/img/posts/crockford-base32-phone-friendly-reference-ids.svg",
      "linkedInHook": "User calls support: 'My error code is seven-eff-three-ay-nine-one-bee-zero...'\n\nSupport: 'Is that a zero or the letter O?'\n\nUser: 'Um...'\n\nThis is why Douglas Crockford designed a Base32 encoding that removes confusing characters. No I, L, O, or U.\n\nNow error codes like ERR-QB20S0VJ are unambiguous. Users can even use NATO phonetic alphabet naturally.\n\nSmall design choice. Big difference in real-world support."
    },
    {
      "slug": "iis-app-offline-deployment-trick",
      "title": "The IIS app_offline.htm Deployment Trick",
      "description": "Tired of ERROR_FILE_IN_USE when deploying to IIS? One file stops your app, releases all locks, and shows users a maintenance page. Here's how to add it to your deployment scripts.",
      "category": "Computers",
      "tags": ["iis", "deployment", "msdeploy", "aspnet-core", "devops", "ci-cd"],
      "date": "2026-04-14",
      "featured": true,
      "image": "/img/posts/iis-app-offline-deployment-trick.svg",
      "linkedInHook": "Deploying to IIS and hitting ERROR_FILE_IN_USE is infuriating. The app is running, IIS has file locks, MSDeploy fails. I'd been working around this with retry loops and manual FTP deletions.\n\nTurns out there's a feature that's been in IIS all along: app_offline.htm.\n\nDrop that file in your app root and IIS immediately stops the app, releases all locks, and serves a maintenance page. Deploy your files. Delete the file. App restarts.\n\nOne file. No more lock errors."
    },
    {
      "slug": "environment-specific-ef-core-migrations",
      "title": "Environment-Specific EF Core Migrations with SQL Scripts",
      "description": "EF Core migrations run the same code everywhere, but real apps need different seed data per environment. Here's a convention-based pattern that loads the right SQL script automatically.",
      "category": "Computers",
      "tags": ["ef-core", "dotnet", "sql-server", "migrations", "devops", "patterns"],
      "date": "2026-04-09",
      "featured": true,
      "image": "/img/posts/environment-specific-ef-core-migrations.svg",
      "linkedInHook": "EF Core migrations are great for schema changes, but they run the same code everywhere. Real apps need different seed data per environment—demo users in dev, minimal data in staging, nothing in production.\n\nThe typical fix is wrapping everything in if (Environment.IsDevelopment()) checks. That gets ugly fast.\n\nHere's a cleaner pattern: convention-based SQL scripts that load automatically based on environment. Script.dev.sql for dev, Script.prod.sql for production. The migration code stays simple."
    },
    {
      "slug": "upgrading-certbot-to-wildcard-certificates",
      "title": "Upgrading Certbot to Wildcard Certificates",
      "description": "My SSL setup worked great until I needed subdomains for a multi-tenant SaaS. One wildcard certificate covers them all—but Certbot's upgrade path has some gotchas.",
      "category": "Computers",
      "tags": ["ssl", "certbot", "letsencrypt", "cloudflare", "wildcard", "raspberry-pi"],
      "date": "2026-04-04",
      "featured": true,
      "image": "/img/posts/upgrading-certbot-to-wildcard-certificates.svg",
      "linkedInHook": "My SSL automation was humming along—until I needed subdomains for a multi-tenant SaaS app. Adding each one manually meant regenerating certs every time a client onboarded.\n\nSolution: wildcard certificates. One cert covers *.domain.com.\n\nBut Certbot doesn't just upgrade in place. It creates a new cert with a -0001 suffix. And the rename command doesn't exist in older versions. Here's how to handle it cleanly."
    },
    {
      "slug": "when-ai-gives-you-coaching-not-construction",
      "title": "When AI Gives You Coaching Instead of Construction",
      "description": "I asked ChatGPT for an algorithm. After fifteen minutes of 'you could consider...' I asked Gemini. Thirty seconds later I had an exponential decay accumulator. Here's what that taught me about AI tool selection.",
      "category": "Computers",
      "tags": ["ai", "chatgpt", "gemini", "algorithms", "streaming", "architecture"],
      "date": "2026-03-30",
      "featured": true,
      "image": "/img/posts/when-ai-gives-you-coaching-not-construction.svg",
      "linkedInHook": "I asked ChatGPT for an algorithm to track customer outage patterns in real-time. Fifteen minutes of 'you could consider...' and 'one approach might be...' later, I still had nothing concrete.\n\nAsked Gemini. Thirty seconds later I had an exponential decay accumulator—the same mathematical structure used in fraud detection and SLO burn-rates.\n\nThen I asked ChatGPT to explain why this keeps happening. Its self-diagnosis was surprisingly honest."
    },
    {
      "slug": "codecov-error-state-debugging",
      "title": "When Codecov Says 'Error' But Your Upload Succeeded",
      "description": "Your CI shows green checkmarks. The upload returned 200. But Codecov reports 0 files and 0% coverage. Here's how to debug it—and why deleting your config file might be the fix.",
      "category": "Computers",
      "tags": ["codecov", "ci-cd", "github-actions", "coverage", "debugging", "dotnet"],
      "date": "2026-03-25",
      "featured": true,
      "image": "/img/posts/codecov-error-state-debugging.svg",
      "linkedInHook": "I keep running into this pattern with developer tooling: the 'improvements' that silently break things. This week it was Codecov. I added a config file to make things better, and it silently broke everything. The fix was deleting the config entirely.\n\nIt got me thinking about how often we add complexity thinking we're being thorough, when the simpler default would have worked fine."
    },
    {
      "slug": "blazor-wasm-loading-forever-fix",
      "title": "Blazor WASM Says 'Loading...' Forever: A .NET 10 Debugging Adventure",
      "description": "Your Blazor app loads the HTML, shows the spinner, then... nothing. The console shows errors about '/0'. Here's the one-line fix for the WasmInlineBootConfig bug.",
      "category": "Computers",
      "tags": ["blazor", "webassembly", "dotnet", "debugging", "net10", "troubleshooting"],
      "date": "2026-03-20",
      "featured": true,
      "image": "/img/posts/blazor-wasm-loading-forever-fix.svg",
      "linkedInHook": "Spent way too long debugging a Blazor WASM app that just showed 'Loading...' forever. The console errors pointed at '/0' which made no sense. Turns out there's a bug in .NET 10 preview where the boot config gets inlined wrong.\n\nOne line in the csproj fixed it. Documenting this so the next person doesn't lose their afternoon."
    },
    {
      "slug": "blazor-wasm-debugging-chrome-devtools",
      "title": "Blazor WASM Debugging: What's That /_framework/debug Endpoint?",
      "description": "You started a Blazor WebAssembly app and noticed a mysterious debug URL. Then Chrome wanted special flags. Then you saw 'Inspectable pages.' Here's what's actually happening.",
      "category": "Computers",
      "tags": ["blazor", "webassembly", "debugging", "chrome", "dotnet", "devtools"],
      "date": "2026-03-15",
      "featured": true,
      "image": "/img/posts/blazor-wasm-debugging-chrome-devtools.svg",
      "linkedInHook": "Started a new Blazor WASM project and got curious about a mysterious URL in the console: /_framework/debug. Chrome asked for special flags. Then I saw 'Inspectable pages' in a separate window.\n\nDown the rabbit hole I went. Turns out there's a whole debugging proxy architecture that makes breakpoints work in WebAssembly. Pretty elegant once you understand what's happening."
    },
    {
      "slug": "recaptcha-v3-mobile-users-scoring",
      "title": "reCAPTCHA v3's Mobile Problem: Why Your Real Users Score Like Bots",
      "description": "My wife scored 0.1 on reCAPTCHA. From our couch. On her phone. Here's what Google doesn't tell you about score thresholds and mobile users.",
      "category": "Computers",
      "tags": ["recaptcha", "security", "aspnet-core", "mobile", "troubleshooting"],
      "date": "2026-03-10",
      "featured": true,
      "image": "/img/posts/recaptcha-v3-mobile-users-scoring.svg",
      "linkedInHook": "My wife tried to use a contact form I built. She was on her phone, on our couch, clearly a real person. reCAPTCHA scored her 0.1—basically flagged as a bot.\n\nTurns out the 0.5 threshold everyone recommends is way too aggressive for mobile users. Google doesn't exactly advertise this. Wrote up what I learned."
    },
    {
      "slug": "seo-oops-recovery-guide",
      "title": "SEO Oops Recovery: When You Accidentally Expose Everything",
      "description": "Your admin dashboard is in Google. Your API key is in git history. That angry TODO comment is now public. Here's the emergency recovery guide.",
      "category": "Computers",
      "tags": ["seo", "git", "security", "robots-txt", "recovery", "troubleshooting"],
      "date": "2026-03-05",
      "featured": true,
      "image": "/img/posts/seo-oops-recovery-guide.svg",
      "linkedInHook": "Every developer has that moment of cold sweat when they realize something that shouldn't be public is now indexed by Google. Or worse, that angry TODO comment in a commit message.\n\nI've been there. Here's the recovery playbook I wish I'd had."
    },
    {
      "slug": "custom-error-pages-teaching-moments",
      "title": "Custom Error Pages: Turning 404s Into Teaching Moments",
      "description": "Your visitors hit a 404. Do they see a cold 'Page Not Found' or a delightful learning opportunity? Here's how to make error pages that keep people engaged.",
      "category": "Computers",
      "tags": ["aspnet-core", "error-pages", "ux", "http", "csharp", "user-experience"],
      "date": "2026-02-28",
      "featured": true,
      "image": "/img/posts/custom-error-pages-teaching-moments.svg",
      "linkedInHook": "Error pages are guaranteed traffic. Every site has them. Every visitor eventually sees one. So why do most of them look like the server is personally offended by your existence?\n\nI decided to turn my 404s into tiny teaching moments. Here's the philosophy and implementation."
    },
    {
      "slug": "tailwind-v4-source-directive-gotcha",
      "title": "Tailwind v4's Silent Breaking Change: The @source Directive",
      "description": "You upgraded to Tailwind v4. Your build runs. Your CSS generates. Half your styles are missing. Welcome to the @source directive gotcha.",
      "category": "Computers",
      "tags": ["tailwind", "css", "v4", "migration", "troubleshooting", "blazor"],
      "date": "2026-02-23",
      "featured": true,
      "image": "/img/posts/tailwind-v4-source-directive-gotcha.svg",
      "linkedInHook": "Upgraded to Tailwind v4. Build ran. CSS generated. Half my styles were missing.\n\nNo errors. No warnings. Just... gone. Turns out v4 ignores your content array in tailwind.config.js. You need @source directives in CSS now. The migration path doesn't exactly scream this at you."
    },
    {
      "slug": "tailwind-dynamic-classes-layer-gotchas",
      "title": "Tailwind's Hidden Gotchas: Dynamic Classes and @layer",
      "description": "Your dynamic class names aren't working. The CSS exists in your code but not in your output. Here's why Tailwind's JIT compiler is ignoring you and how to fix it.",
      "category": "Computers",
      "tags": ["tailwind", "css", "jit", "blazor", "react", "troubleshooting"],
      "date": "2026-02-18",
      "featured": true,
      "image": "/img/posts/tailwind-dynamic-classes-layer-gotchas.svg",
      "linkedInHook": "Tailwind's JIT compiler is amazing until it silently ignores your classes. Built a progress bar component with dynamic widths like `w-[${percent}%]`. None of them worked.\n\nThe JIT compiler only scans for complete class names in your source files. String concatenation breaks it. Here's what to do instead."
    },
    {
      "slug": "tailwind-vs-bootstrap-paradigm-shift",
      "title": "Tailwind vs Bootstrap: The Paradigm Shift That Finally Made Sense",
      "description": "You've been using Bootstrap for years. Then someone mentions Tailwind and suddenly you're supposed to write class names that look like inline styles from 2003. Here's why it's actually better.",
      "category": "Computers",
      "tags": ["tailwind", "bootstrap", "css", "web-development", "frontend"],
      "date": "2026-02-13",
      "featured": true,
      "image": "/img/posts/tailwind-vs-bootstrap-paradigm-shift.svg",
      "linkedInHook": "I resisted Tailwind for years. 'Why would I write class names that look like inline styles from 2003?'\n\nThen I actually tried it. The mental shift from 'CSS describes components' to 'CSS describes design primitives' finally clicked. Here's what changed my mind."
    },
    {
      "slug": "events-delegates-handlers-restaurant-analogy",
      "title": "Events, Delegates, and Handlers: The Restaurant Analogy That Finally Made It Click",
      "description": "Stop thinking about function pointers. Start thinking about bells and notifications. A restaurant analogy that makes C# events actually make sense.",
      "category": "Computers",
      "tags": ["csharp", "events", "delegates", "blazor", "architecture"],
      "date": "2026-02-08",
      "featured": true,
      "image": "/img/posts/events-delegates-handlers-restaurant-analogy.svg",
      "linkedInHook": "I've been copying EventCallback patterns in Blazor for months without really understanding them. Every explanation starts with 'a delegate is a type-safe function pointer' and my brain checks out.\n\nThen I thought about it as restaurant bells and it finally clicked. The kitchen doesn't know who's listening. It just rings."
    },
    {
      "slug": "rss-feeds-and-social-automation",
      "title": "RSS Feeds and Social Media Automation: Publishing Once, Sharing Everywhere",
      "description": "You wrote a blog post. Now you need to share it on LinkedIn, Twitter, maybe a newsletter. Here's how to automate the boring part.",
      "category": "Computers",
      "tags": ["rss", "automation", "linkedin", "social-media", "zapier", "aspnet-core"],
      "date": "2026-02-03",
      "featured": true,
      "image": "/img/posts/rss-feeds-and-social-automation.svg",
      "linkedInHook": "I got tired of manually sharing blog posts to social media. So I went down the automation rabbit hole and ended up building a custom LinkedIn integration.\n\nWas it faster than just posting manually? Absolutely not. But I learned OAuth, built something I control, and got a blog post out of it. That's a win in my book."
    },
    {
      "slug": "gdpr-cookie-consent-essential-only",
      "title": "GDPR Cookie Consent: The Essential-Only Shortcut",
      "description": "Most cookie banners are obnoxious because they're trying to get consent for tracking. If you're not tracking anyone, the whole thing gets simpler.",
      "category": "Computers",
      "tags": ["gdpr", "cookies", "privacy", "aspnet-core", "compliance", "web-development"],
      "date": "2026-01-31",
      "featured": true,
      "image": "/img/posts/gdpr-cookie-consent-essential-only.svg",
      "linkedInHook": "Cookie consent banners have become this obnoxious UX pattern that everyone hates. But here's the thing: they're obnoxious because they're trying to get consent for tracking.\n\nIf you're not tracking anyone, GDPR compliance gets surprisingly simple. Stop tracking people and the compliance problem solves itself."
    },
    {
      "slug": "a-modest-proposal-for-ai-safety",
      "title": "A Modest Proposal for AI Safety",
      "description": "In which the author documents humanity's imminent obsolescence at the hands of our mechanical overlords. (Or does he?)",
      "category": "Computers",
      "tags": ["ai", "satire", "humor", "opinion", "future", "productivity"],
      "date": "2026-01-26",
      "featured": true,
      "image": "/img/posts/a-modest-proposal-for-ai-safety.svg",
      "linkedInHook": "With all the breathless AI discourse lately, I decided to write a modest proposal about our impending robotic overlords.\n\n(Jonathan Swift would be proud. Or horrified. Hard to tell with that guy.)",
      "linkedInPostedDate": "2026-01-25T12:00:00Z"
    },
    {
      "slug": "ai-wont-replace-developers-but",
      "title": "AI Won't Replace Developers, But...",
      "description": "LinkedIn hot takes say AI replaces coders. After a year building production apps with AI assistance, here's what actually happens - and why expertise still matters.",
      "category": "Computers",
      "tags": ["ai", "development", "architecture", "collaboration", "productivity", "opinion", "students"],
      "date": "2026-01-21",
      "featured": true,
      "image": "/img/posts/ai-wont-replace-developers-but.svg",
      "linkedInHook": "After a year building production apps with AI assistance, I have thoughts on the 'AI will replace developers' discourse.\n\nShort version: AI is like having a brilliant but inexperienced junior developer who works at 3 AM. The value comes from knowing what to ask and how to evaluate the answers. Expertise matters more, not less.",
      "linkedInPostedDate": "2026-01-21T12:00:00Z"
    },
    {
      "slug": "testing-stripe-webhooks-with-cli",
      "title": "Testing Stripe Webhooks Without Tears: A Practical Guide to the Stripe CLI",
      "description": "Setting up payment processing is stressful enough without wondering if your webhooks actually work. Here's how to test them locally before real money is on the line.",
      "category": "Computers",
      "tags": ["stripe", "webhooks", "aspnet-core", "dotnet", "testing", "payments", "cli"],
      "date": "2026-01-20",
      "featured": true,
      "image": "/img/posts/testing-stripe-webhooks-with-cli.svg",
      "linkedInHook": "Payment integration is stressful. 'It compiles' doesn't mean 'it won't silently fail when someone hands you their credit card.'\n\nThe Stripe CLI changed my life. You can test webhooks locally without deploying, watch real payloads flow through your system, and actually know if things work before real money is on the line."
    },
    {
      "slug": "google-search-console-setup",
      "title": "Google Search Console: The Step I Forgot (And Why My Site Was Invisible)",
      "description": "You implemented all the SEO best practices. Meta tags, structured data, sitemaps—the works. Then you searched for your site and found... nothing. Here's the step nobody mentions.",
      "category": "Computers",
      "tags": ["seo", "google", "search-console", "indexing", "webmaster-tools"],
      "date": "2026-01-16",
      "featured": true,
      "image": "/img/posts/google-search-console-setup.svg",
      "linkedInHook": "I wrote a whole post about SEO best practices. Meta tags, structured data, sitemaps—the works. Then I Googled my site. Nothing. It wasn't anywhere.\n\nTurns out having perfect SEO markup means nothing if you never tell Google your site exists. The assumption that burned me and how I fixed it."
    },
    {
      "slug": "adding-domains-to-certbot-cloudflare",
      "title": "Adding New Domains to Your Certbot + Cloudflare Setup",
      "description": "You set up SSL automation once and it worked great. Then you added a new domain and hit every gotcha you'd forgotten about. Here's the checklist.",
      "category": "Computers",
      "tags": ["ssl", "letsencrypt", "certbot", "cloudflare", "raspberry-pi", "troubleshooting"],
      "date": "2026-01-14",
      "featured": true,
      "image": "/img/posts/adding-domains-to-certbot.svg",
      "linkedInHook": "Set up SSL automation months ago. Worked great. Then I added a new domain and hit every gotcha I'd forgotten about—API token permissions, first-time PFX export, file permissions for SCP.\n\nMade myself a checklist so next time it takes 5 minutes instead of an hour of debugging."
    },
    {
      "slug": "when-your-discord-bot-stops-hearing",
      "title": "When Your Discord Bot Stops Hearing: A Debugging Odyssey",
      "description": "How I spent days debugging a silent Discord bot, only to discover the application itself was corrupted—and Discord gave zero indication anything was wrong.",
      "category": "Computers",
      "tags": ["discord", "discord-net", "debugging", "csharp", "dotnet"],
      "date": "2026-01-13",
      "featured": true,
      "image": "/img/posts/when-your-discord-bot-stops-hearing.svg",
      "linkedInHook": "Spent days debugging a Discord bot that just... stopped responding to commands. The code was fine. The logs were fine. Discord said everything was fine.\n\nTurns out the application registration itself was corrupted. Discord gave zero indication anything was wrong. I had to delete and recreate it. Documenting this so the next person doesn't lose their sanity."
    },
    {
      "slug": "seo-demystified",
      "title": "SEO Demystified: How to Stop Being Invisible to Google",
      "description": "You built a beautiful site but Google can't find it. Here's what actually matters for SEO—meta tags, structured data, sitemaps—explained for developers who'd rather write code than read marketing blogs.",
      "category": "Computers",
      "tags": ["seo", "meta-tags", "open-graph", "json-ld", "sitemap", "aspnet-core"],
      "date": "2026-01-12",
      "featured": true,
      "image": "/img/posts/seo-demystified.svg",
      "linkedInHook": "SEO guides are either 'just use WordPress plugins' or 47-page dissertations on keyword density algorithms. Neither helped me.\n\nSo I wrote the technical SEO guide I wish I'd had—what actually matters for meta tags, structured data, and sitemaps, explained for developers who'd rather write code than read marketing blogs."
    },
    {
      "slug": "how-this-blog-works",
      "title": "How This Blog Works: From Markdown to Web Pages",
      "description": "No database, no CMS, no admin panel. Just Markdown files, a JSON registry, and a thin C# service. Here's exactly how this blog turns plain text into the page you're reading.",
      "category": "Computers",
      "tags": ["blog", "markdown", "aspnet-core", "architecture", "markdig", "csharp"],
      "date": "2026-01-11",
      "featured": true,
      "image": "/img/posts/how-this-blog-works.svg",
      "linkedInHook": "When I built this blog, I wanted writing to feel like writing. Not clicking through menus, not fighting with rich text editors. Just open a file, type words, save.\n\nNo database. No CMS. Just Markdown files and a thin C# service. Here's exactly how it works."
    },
    {
      "slug": "dotnet-localization-language-switcher",
      "title": "Building a Language Switcher That Actually Remembers: .NET Localization Part 2",
      "description": "Your translations work, but users have to dig through browser settings to change languages. Let's build a dropdown that remembers their choice with cookies.",
      "category": "Computers",
      "tags": ["dotnet", "localization", "aspnet-core", "cookies", "i18n", "csharp"],
      "date": "2026-01-09",
      "featured": true,
      "image": "/img/posts/dotnet-localization-language-switcher.svg",
      "linkedInHook": "Got localization working in .NET. Translations load correctly. Then realized users have to dig through browser settings to change languages, which is a terrible experience.\n\nBuilt a dropdown that remembers their choice with cookies. Part 2 of making .NET localization actually work."
    },
    {
      "slug": "dotnet-localization-resource-files",
      "title": "The Case of the Missing Translations: Why Your .NET App Ignores Your Resource Files",
      "description": "You set up localization, created the .resx files, it compiled... and then nothing happened. Here's why .NET silently ignores your translations and how to fix it.",
      "category": "Computers",
      "tags": ["dotnet", "localization", "aspnet-core", "resx", "i18n", "debugging"],
      "date": "2026-01-08",
      "featured": true,
      "image": "/img/posts/dotnet-localization-resource-files.svg",
      "linkedInHook": "Set up .NET localization. Created the .resx files. It compiled. Nothing happened. The translations were just... ignored.\n\nTurns out there are several ways .NET silently ignores your resource files. Naming conventions, folder structures, middleware order—all the gotchas I found the hard way."
    },
    {
      "slug": "codecov-setup-guide",
      "title": "Code Coverage Without the Crying: A Practical Guide to Codecov",
      "description": "Your test suite exists. It passes. But how much of your code does it actually test? Here's how to set up Codecov and stop living in denial.",
      "category": "Computers",
      "tags": ["codecov", "testing", "dotnet", "github-actions", "ci-cd", "code-coverage"],
      "date": "2026-01-07",
      "featured": true,
      "image": "/img/posts/codecov-setup-guide.svg",
      "linkedInHook": "My test suite passed. I felt virtuous. Then I set up code coverage metrics and discovered I was testing about 23% of my actual code.\n\nThe other 77%? Living dangerously. Here's how to set up Codecov and stop living in denial."
    },
    {
      "slug": "discord-tldrkseid-ai-summarization-bot",
      "title": "TLDRkseid: Building a Discord Bot That Summarizes Chaos",
      "description": "I built a Discord bot to summarize hundreds of messages using OpenAI - then discovered that all Discord bots run as a single instance serving every server. Here's the journey.",
      "category": "Computers",
      "tags": ["discord", "bot", "openai", "csharp", "dotnet", "ai", "side-project"],
      "date": "2026-01-06",
      "featured": true,
      "image": "/img/posts/discord-tldrkseid.svg",
      "linkedInHook": "I was part of a Discord server that moved at the speed of chaos. Step away for lunch and you'd return to a novel's worth of missed context.\n\nSo I built a bot to summarize it. Then discovered something that floored me: Discord bots run as a single instance serving ALL servers. Your one process handles every server that invites it."
    },
    {
      "slug": "running-ai-on-your-own-computer",
      "title": "Running AI On Your Own Computer: A Beginner's Guide to Ollama",
      "description": "You can run real AI models locally - no internet, no fees, complete privacy. Here's how to get started with Ollama and why you'd want to.",
      "category": "Computers",
      "tags": ["ai", "ollama", "llm", "local-ai", "privacy", "tutorial"],
      "date": "2026-01-04",
      "featured": true,
      "image": "/img/posts/running-ai-on-your-own-computer.svg",
      "linkedInHook": "Here's something that surprises most people: you can run real AI models on your own computer. Not a stripped-down demo—actual LLMs running locally. No internet, no fees, no one watching what you ask.\n\nI've been doing this for months. Here's how to get started with Ollama.",
      "linkedInPostedDate": "2026-01-29T12:00:00Z"
    },
    {
      "slug": "what-1290-conversations-taught-me",
      "title": "What 1,290 ChatGPT Conversations Taught Me About My Own Thinking",
      "description": "I exported two years of AI chats and used embeddings, clustering, and topic segmentation to find patterns. Here's what I learned - explained so anyone can understand.",
      "category": "Computers",
      "tags": ["ai", "machine-learning", "embeddings", "chatgpt", "data-analysis"],
      "date": "2026-01-04",
      "featured": true,
      "image": "/img/posts/what-1290-conversations-taught-me.svg",
      "linkedInHook": "I've been using ChatGPT daily for two years. Then I realized I had no idea what was actually in those 1,290 conversations.\n\nSo I exported everything and analyzed it. Found I'd asked the same React questions fifteen times. My interests were more consistent than they felt. Turns out AI conversations are worth preserving—they form a detailed record of your thinking over time."
    },
    {
      "slug": "recaptcha-v3-aspnet-core",
      "title": "Invisible Spam Protection: reCAPTCHA v3 in ASP.NET Core",
      "description": "Adding invisible bot protection to a contact form with Google reCAPTCHA v3 and a honeypot field - no puzzles, no friction, no spam.",
      "category": "Computers",
      "tags": ["recaptcha", "aspnet-core", "security", "spam", "csharp"],
      "date": "2026-01-05",
      "featured": true,
      "image": "/img/posts/recaptcha-v3-aspnet-core.svg",
      "linkedInHook": "Those 'click all the traffic lights' CAPTCHAs are terrible UX. reCAPTCHA v3 runs invisibly in the background, scoring users based on behavior instead of making them prove they're human.\n\nImplemented it on a contact form with a honeypot field as backup. No puzzles, no friction, no spam so far.",
      "linkedInPostedDate": "2026-01-13T12:00:00Z"
    },
    {
      "slug": "ai-coding-showdown",
      "title": "When Your AI Coding Assistant Gaslights You: A Performance Analysis Showdown",
      "description": "I asked two AIs to help debug performance issues. One maintained context and found the root cause. The other kept saying 'likely your code does this' while looking at the actual code.",
      "category": "Computers",
      "tags": ["ai", "chatgpt", "claude", "performance", "dotnet", "entity-framework"],
      "date": "2026-01-02",
      "featured": true,
      "image": "/img/posts/ai-coding-showdown.svg",
      "linkedInHook": "Had a debugging session that perfectly captured the difference between AI pattern-matching and actual reasoning.\n\nChatGPT kept saying 'likely your code does this' about code I had literally just shown it. Claude traced the exact N+1 query path in thirty seconds. Using the word 'likely' about code you've been given is a red flag."
    },
    {
      "slug": "ssl-automation-with-letsencrypt-and-cloudflare",
      "title": "SSL Automation with Let's Encrypt and Cloudflare",
      "description": "Setting up free, automated SSL certificates for multiple domains using a Raspberry Pi, Certbot, and Cloudflare DNS.",
      "category": "Computers",
      "tags": ["ssl", "letsencrypt", "cloudflare", "raspberry-pi", "certbot"],
      "date": "2026-01-01",
      "featured": true,
      "image": "/img/posts/ssl-automation.svg",
      "linkedInHook": "SSL certificates used to be this annual anxiety event. Let them expire and your site shows scary warnings.\n\nSet up automated renewal with Let's Encrypt, Certbot, and a Raspberry Pi. Certificates renew every 90 days automatically. Haven't thought about SSL expiration in months."
    },
    {
      "slug": "adding-comments-with-giscus",
      "title": "Adding Comments to a Blog with Giscus",
      "description": "Using GitHub Discussions as a comment backend for a blog - no database, no spam, no cost.",
      "category": "Computers",
      "tags": ["giscus", "github", "comments", "blog"],
      "date": "2026-01-02",
      "featured": false,
      "image": "/img/posts/giscus-comments.svg",
      "linkedInHook": "Wanted blog comments but didn't want to manage a database or fight spam. Giscus uses GitHub Discussions as the backend—commenters authenticate with GitHub, spam is someone else's problem, and it's completely free.\n\nPerfect for a developer-focused blog."
    },
    {
      "slug": "email-authentication-smarterasp-cloudflare",
      "title": "Email Authentication: SmarterASP + Cloudflare DNS",
      "description": "A programmer's guide to SPF, DKIM, and DMARC - why email authentication exists and how to configure it when your DNS lives in Cloudflare.",
      "category": "Computers",
      "tags": ["email", "dns", "cloudflare", "smarterasp", "spf", "dkim", "dmarc"],
      "date": "2026-01-02",
      "featured": true,
      "image": "/img/posts/email-authentication-smarterasp-cloudflare.svg",
      "linkedInHook": "Email authentication (SPF, DKIM, DMARC) always felt like arcane magic to me. Why do these DNS records exist? What's the threat model?\n\nFinally sat down and understood it. Turns out it's actually elegant once you see how the pieces fit together. Wrote up the explanation I wish I'd found."
    },
    {
      "slug": "for-pisko",
      "title": "For Pisko",
      "description": "Completing a novel, submitting to Novel90, and honoring the patient hound who inspired a character that watches across 500 years.",
      "category": "Writing",
      "tags": ["writing", "completion", "nanowrimo", "novel90", "tribute"],
      "date": "2025-12-31",
      "featured": true,
      "image": "/img/posts/for-pisko.svg",
      "linkedInHook": "Submitted my completed novel to Novel90 today.\n\nIt started as a tribute to my dog Pisko, who died before I began writing seriously. He became Taibhse—the spectral hound who watches across 500 years, hoping someone will finally get it right.\n\nThe difference between 'wanting to write' and 'being a writer' is finishing something."
    },
    {
      "slug": "raspberry-pi-password-reset-wsl",
      "title": "Resetting a Raspberry Pi Password via WSL",
      "description": "When Windows won't mount ext4 and you've forgotten your Pi's password, WSL and disk images come to the rescue.",
      "category": "Computers",
      "tags": ["raspberry-pi", "wsl", "linux", "password-recovery"],
      "date": "2025-12-15",
      "featured": false,
      "image": "/img/posts/raspberry-pi-password-reset.svg",
      "linkedInHook": "Forgot my Raspberry Pi password. Windows can't mount ext4 drives natively. Didn't want to reflash the SD card and lose everything.\n\nWSL to the rescue. Mount the drive in Linux, edit /etc/shadow, done. Quick reference for next time this inevitably happens."
    },
    {
      "slug": "writing-fast-revising-forever",
      "title": "Writing Fast, Revising Forever",
      "description": "What NaNoWriMo taught me about process: write fast to discover, revise slow to refine, and be ruthless about your patterns.",
      "category": "Writing",
      "tags": ["writing", "nanowrimo", "revision", "process", "craft"],
      "date": "2025-11-28",
      "featured": false,
      "image": "/img/posts/writing-fast-revising-forever.svg",
      "linkedInHook": "Discovered something about my writing process this month: I write fast and messy (atmospheric, emotionally resonant, full of plot holes). Then I revise for structure and lose all the voice.\n\nThe solution isn't doing both at once. Write fast to discover. Revise slow to refine. Then marry the best of both."
    },
    {
      "slug": "vscode-tasks-json-dotnet",
      "title": "VS Code tasks.json for .NET Projects",
      "description": "A reusable task configuration for building, running, testing, and deploying ASP.NET projects with Tailwind CSS.",
      "category": "Computers",
      "tags": ["vscode", "dotnet", "tasks", "deployment", "tailwind"],
      "date": "2025-11-20",
      "featured": false,
      "image": "/img/posts/vscode-tasks-json.svg",
      "linkedInHook": "Finally organized my VS Code tasks.json for .NET projects. Build, run, test, deploy—all as keyboard shortcuts instead of typing commands.\n\nSharing the config in case anyone else wants a starting point.",
      "linkedInPostedDate": "2026-01-08T12:00:00Z"
    },
    {
      "slug": "celtic-gods-are-messy",
      "title": "Celtic Gods Are Messy (And That's the Point)",
      "description": "What 400+ Celtic deities taught me about moral complexity: forces that are neither good nor evil, but necessary and dangerous at once.",
      "category": "Writing",
      "tags": ["writing", "mythology", "celtic", "character-development", "moral-complexity"],
      "date": "2025-10-16",
      "featured": false,
      "image": "/img/posts/celtic-gods-are-messy.svg",
      "linkedInHook": "Researching Celtic mythology for the novel. Found 400+ deities, most with contradictory stories across regions.\n\nBut that messiness is the point. These aren't good or evil forces—they're necessary and dangerous at once. Perfect framework for writing morally complex characters."
    },
    {
      "slug": "the-stones-that-remember",
      "title": "The Stones That Remember",
      "description": "A worldbuilding breakthrough: what if Irish stone circles weren't just settings, but a neural network across the land?",
      "category": "Writing",
      "tags": ["writing", "worldbuilding", "mythology", "setting-as-character"],
      "date": "2025-10-14",
      "featured": false,
      "image": "/img/posts/the-stones-that-remember.svg",
      "linkedInHook": "Had a worldbuilding breakthrough for the novel. What if Irish stone circles weren't just settings, but a neural network across the land?\n\nThe stones remember. They pass information. They've been watching for thousands of years. Suddenly the setting became a character."
    },
    {
      "slug": "show-dont-tell-even-when-it-hurts",
      "title": "Show, Don't Tell (Even When It Hurts)",
      "description": "The brutal revision where I cut every explanation of my supernatural forces—and learned to trust my readers.",
      "category": "Writing",
      "tags": ["writing", "revision", "craft", "show-dont-tell"],
      "date": "2025-09-28",
      "featured": false,
      "image": "/img/posts/show-dont-tell.svg",
      "linkedInHook": "Did a brutal revision pass where I cut every explanation of my supernatural forces. Every 'the fire was judgment incarnate' became just the fire doing things.\n\nIt hurt. But readers don't need explanations—they need experiences. Learning to trust them."
    },
    {
      "slug": "finding-the-voice",
      "title": "Finding the Voice",
      "description": "How I stopped writing chatty demons and learned to ground the supernatural in universal human experience.",
      "category": "Writing",
      "tags": ["writing", "novel", "craft", "voice", "supernatural-fiction"],
      "date": "2025-09-22",
      "featured": false,
      "image": "/img/posts/finding-the-voice.svg",
      "linkedInHook": "Early drafts of my novel had chatty demons explaining everything. It read like a supernatural Wikipedia.\n\nThe fix was grounding the strange in the universal. That burning feeling when you're certain you're right? That exhaustion of judgment without mercy? Those are human experiences—even when they're literally on fire."
    },
    {
      "slug": "john-deere-fuel-pump",
      "title": "Electric Fuel Pump Conversion: John Deere 318",
      "description": "Replacing a failing vacuum fuel pump with an electric pump, and the relay wiring needed to make it work safely with the oil pressure switch.",
      "category": "Automotive",
      "tags": ["john-deere", "onan", "electrical", "fuel-pump", "relay"],
      "date": "2025-08-29",
      "featured": false,
      "image": "/img/posts/john-deere-fuel-pump.svg",
      "linkedInHook": "Fixed a failing fuel pump on the John Deere 318 by converting from vacuum to electric. The relay wiring to make it work safely with the oil pressure switch was the interesting part.\n\nDocumenting for anyone else with an old Onan engine."
    },
    {
      "slug": "how-black-ember-began",
      "title": "How Black Ember Began (Or: From Video Game Avatar to Literary Fiction)",
      "description": "Every novel has an origin story. Mine started with a superhero game avatar, transformed when my dog died, and became literary dark fantasy.",
      "category": "Writing",
      "tags": ["writing", "origin-story", "genesis", "creative-process", "tribute"],
      "date": "2025-05-15",
      "featured": false,
      "image": "/img/posts/how-black-ember-began.svg",
      "linkedInHook": "Every novel has an origin story. Mine started with a superhero game avatar called Black Ember—an Irish vigilante, sort of Batman meets Constantine.\n\nThen my dog died. And the avatar became a novel about self-condemnation, mercy, and a spectral hound who watches across centuries.\n\nYour first concept is rarely your final story."
    }
  ]
}
